from chatterbot import ChatBot
chatbot = ChatBot("Vishwajeet", language='MAR')

from chatterbot.trainers import ListTrainer

conversation = [
    "नमस्कार",
    "नमस्कार!",
    "आपण कसे आहात?",
    "मी छान करतोय.",
    "हे ऐकून चांगले आहे",
    "धन्यवाद.",
    "आपले स्वागत आहे.",
    "बाय",
    "जेव्हा आपण सुई घालाल तेव्हा दुखेल?",
    "फक्त एका क्षणासाठी. आपल्या बाहूच्या मांसल, मऊ अंडरसाइडवर चिमूटभर. सुई घातल्यावर आपल्याला काय वाटेल ते चिमूटभर.",
    "रक्तदान सुरक्षित आहे का?",
    "होय, रक्तदान करणे खूपच सुरक्षित मानले जाते. प्रत्येक रक्तदात्यासाठी निर्जंतुकीकरण, डिस्पोजेबल वैद्यकीय उपकरणे वापरली जातात ज्यामुळे रक्तजनित संसर्गाच्या जोखमीकडे दुर्लक्ष होते."
    "रक्त देण्यासाठी किती वेळ लागतो?",
    "संपूर्ण रक्तदान प्रक्रियेस सुमारे 45 मिनिटे लागतात, तर रक्त घेण्याची प्रक्रिया स्वतःच 10 मिनिटे घेते.",
    "मी रक्तदान कोठे करू शकतो?",
    "जवळच्या रक्तपेढीची स्थाने मिळविण्यासाठी आमच्याकडे नोंदणी करा",
    "रक्तदान प्रक्रिया कशी कार्य करते?",
    "रक्तदान करणे ही एक सोपी गोष्ट आहे, परंतु इतरांच्या जीवनात मोठा फरक पडू शकतो. आपण येईपर्यंत देणगी देण्याच्या प्रक्रियेस सुमारे एक तास लागतो. देणगी फक्त 8-10 मिनिटे असते सरासरी.",
    "रक्तदान केल्यावर मी काय करावे?",
    "नॉन-अल्कोहोलिक द्रव्यांपैकी प्रत्येकी आठ औंस अतिरिक्त चार ग्लास प्या.",
    "मी दान केलेल्या रक्ताचे काय होते?",
    "रक्तपेढीतील आपल्या रक्तावर प्रक्रिया केली जाते आणि रक्त संकलनाच्या 6 तासांच्या आत ते घटकांमध्ये विभागले जाते. लाल पेशी, श्वेत पेशी, प्लाझ्मा आणि प्लेटलेट्स. हे रक्त घटक रूग्णांसाठी उपलब्ध आहेत. रक्त घटक बनवून, सर्व रक्त रक्ताचे उपयुक्त भाग वापरले जाऊ शकतात आणि रक्ताच्या एका युनिटमधून चार रुग्णांना फायदा होऊ शकतो "
]

trainer = ListTrainer(chatbot)

trainer.train(conversation)
print('SAY SOMETHING!')
while(1==1):
    x = input()
    response = chatbot.get_response(x)
    print(response)


